<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class RecipesSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $recipes = [
            [
                "name" => "Красный борщ",
                "image" => "null",
                "slug" => "borsch",
                "description" => "Знаменитый красный борщ любят за особенный аромат, удивительный вкус и насыщенный цвет. Идеальное сочетание овощей придают красному борщу тот индивидуальный вкус, благодаря которому он входит в список самых известных супов мира. Борщ подают в дорогих ресторанах и готовят дома. Всякий раз, когда есть возможность попробовать борщ, мы выбираем именно его.",
                "level" => 5,
                "time" => 140,
                "ingredients" => "Мясо на кости - 800 г, Фасоль - 50 г, Свекла - 400 г, Капуста белокочанная - 250 г, Картофель мелкий - 6 шт., Морковь - 2 шт., Лук репчатый - 2 шт., Томатная паста - 140 г, Лавровый лист - 3 шт., Сахар - 1 ст. ложка, Уксус 9% - 1 ст. ложка, Перец черный горошком - 10 шт., Соль - 3 ч. ложки, Лук зеленый - 5 г, Чеснок - 3 зубчика, Укроп свежий - 15 г, Петрушка свежая - 15 г, Масло растительное - 3 ст. ложки, Вода - 2,5 л, Сметана (для подачи) - по вкусу",
                "likes" => 76,
                "kitchen_id" => 1,
            ],
            [
                "name" => "Ленивые пельмени",
                "image" => "null",
                "slug" => "Lazy-dumplings",
                "description" => "Эти пельмени можно отнести, пожалуй, к самым «ленивым». Никакого замеса теста, никакой лепки. Раз - и «ленивый» вариант пельменей уже на тарелке.",
                "level" => 1,
                "time" => 25,
                "ingredients" => "Фарш мясной – 200 г, Яйца – 3 шт., Вода – 110 мл, Мука пшеничная – 200 г, Соль – ½ ч. л. в тесто + для варки, Перец молотый черный – по вкусу, Лавровый лист – 2-3 шт., Масло сливочное, Сметана, Зелень свежая",
                "likes" => 88,
                "kitchen_id" => 1,
            ],
            [
                "name" => "Гречка по-купечески",
                "image" => "null",
                "slug" => "borsch",
                "description" => "Гречка. Если вы никогда не пробовали такой вариант гречки, бегом на кухню! Гречка по-купечески с мясным фаршем - вкусно, полезно и быстро.",
                "level" => 3,
                "time" => 75,
                "ingredients" => "Гречневая крупа - 1 стакан, Фарш мясной - 300 г, Лук репчатый - 1 шт., Морковь - 1 шт., Чеснок - 2 зубка, Паста томатная - 2 ст. ложки, Масло подсолнечное - 20 г, Соль - по вкусу",
                "likes" => 88,
                "kitchen_id" => 1,
            ],
            [
                "name" => "Курник",
                "image" => "null",
                "slug" => "Curnik",
                "description" => "Существует несколько вариантов приготовления курника: с блинами и рисом, с белыми грибами и картофелем, но традиционно, во всех случаях, – с куриным мясом. Курицу кладут в курник в любом виде, это могут быть бедрышки, голени и крылышки, но для семьи я предпочитаю готовить пирог с куриным филе и картофелем, из пресного теста на маргарине.",
                "level" => 2,
                "time" => 45,
                "ingredients" => "Куриное филе - 500 г, Картофель - 4 шт., Лук репчатый - 4 шт., Яйца - 2 шт., Маргарин - 200 г, Молоко - 100 мл, Мука - 500 г, Соль - 1 ч.л. (по вкусу), Перец чёрной молотый - 1 ч.л. (или по вкусу)",
                "likes" => 33,
                "kitchen_id" => 1,
            ],
            [
                "name" => "Ризотто с курицей и грибами",
                "image" => "null",
                "slug" => "Risotto-chicken-and-mushrooms",
                "description" => "Популярное итальянское блюдо из «крахмалистого» риса особого сорта (арборио). Хотя определенного рецепта ризотто не существует (продукты могут быть любыми, в нашем случае – грибы с курицей), основное правило – кремообразная структура и чуть твердоватый внутри рис. Чтобы придать дополнительную вязкость, в рис добавляют бульон или воду, и готовится ризотто при постоянном помешивании. Ризотто с курицей – один из самых популярных вариантов этого блюда.",
                "level" => 3,
                "time" => 50,
                "ingredients" => "Масло сливочное – 2 ст. л., Грибы, тонко нарезанные – 220 г, Куриные грудки, филе, нарезанное кусочками по 1 см – 300 г, Соль – 1 ч. л., Перец черный молотый – ¼ ч. л., Бульон куриный – 5 ½ стакана, Масло растительное – 1 ст. л., Лук репчатый, нарезанный – ½ стакана, Рис Арборио – 1 ½ стакана, Вино сухое белое – ½ стакана, Сыр Пармезан тертый – ½ стакана, Зелень петрушки нарезанная – 2 ст. л.",
                "likes" => 12,
                "kitchen_id" => 2,
            ],
            [
                "name" => "Паста Карбонара",
                "image" => "null",
                "slug" => "borsch",
                "description" => "Легендарная паста карбонара. Не слушайте никого, в настоящей карбонаре не бывает сливок. При правильном приготовлении вы обязательно почувствуете мягкий сливочный вкус - то, за что любят это блюдо. В чем секрет? Попробуйте приготовить спагетти карбонара, это просто с нашим рецептом.",
                "level" => 1,
                "time" => 30,
                "ingredients" => "Спагетти - 400 г, Грудинка варено-копчёная - 200 г, Яйцо куриное - 1 шт., Желтки - 3 шт., Сыр пармезан - 75 г, Масло сливочное - 2 ст.ложки, Масло оливковое - 1 ст.ложка, Чеснок - 2 зубчика, Соль - по вкусу, Перец черный - по вкусу",
                "likes" => 56,
                "kitchen_id" => 2,
            ],
            [
                "name" => "Крем-карамель",
                "image" => "null",
                "slug" => "Cream-caramel",
                "description" => "Чудо-десерт из самых простых продуктов. Как в ресторане! Крем-карамель, или флан. Нежнейший ванильный крем и ароматный карамельный соус - десерт просто тает во рту! А готовить крем-карамель очень просто и быстро. Такой десерт прекрасно подойдет на праздничный, в том числе новогодний",
                "level" => 2,
                "time" => 35,
                "ingredients" => "Молоко – 600 мл, Яйца – 5 шт., Сахар – 80 г, Ванильный сахар – 1 ч. ложка, Соль – 0,5 ч. ложки, Сахар – 120 г, Вода – 40 мл",
                "likes" => 4,
                "kitchen_id" => 4,
            ],
            [
                "name" => "Паэлья с курицей и горошком",
                "image" => "null",
                "slug" => "Paella-chicken-and-peas",
                "description" => "Традиционное русское блюдо",
                "level" => 4,
                "time" => 65,
                "ingredients" => "Голени куриные - 3 шт., Перец болгарский - 2 шт., Лук репчатый - 1 шт., Лук репчатый красный - 1 шт., Горошек зеленый - 100 г, Масло растительное - 30 мл, Паста томатная - 1 ст. л., Бульон куриный - 1 стакан, Шафран - 0,5 ч. л., Рис круглый - 120 г, Соль - по вкусу, Перец черный молотый - по вкусу",
                "likes" => 65,
                "kitchen_id" => 4,
            ],
            [
                "name" => "Картофельная тортилья",
                "image" => "null",
                "slug" => "Potato-tortilla",
                "description" => "Испанская тортилья - вкусное и сытное блюдо из картофеля и яиц, с сыром и помидорами, - станет украшением стола и порадует вас не только своим видом, но и чудесным вкусом.",
                "level" => 2,
                "time" => 75,
                "ingredients" => "Картофель среднего размера - 2 шт., Помидор некрупный - 1 шт., Лук репчатый - 1 шт., Сыр твердый - 30 г, Сыр фета - 50 г, Яйца куриные - 2 шт., Сметана - 100 г, Масло оливковое (для смазывания формы) - 0,5 ч. ложки, Прованские травы - 0,5-1 ч. ложка (по вкусу), Соль - по вкусу, Перец черный молотый - по вкусу, Тимьян (для подачи) - 1 веточка",
                "likes" => 21,
                "kitchen_id" => 4,
            ],
            [
                "name" => "Хачапури по-аджарски",
                "image" => "null",
                "slug" => "Khachapuri-in-Ajar",
                "description" => "Давно ходил вокруг рецепта хачапури по-аджарски, не решался. Сегодня попробовал - я в полном восторге! Тесто замечательное, интересный процесс приготовления, а вкус - не передать, просто сказка! Кавказ, прости, что так долго тянул с этим рецептом.) Много потерял. Вся семья оценила аджарские хачапури на 5 баллов! Готовится просто, повторяйте на здоровье!",
                "level" => 3,
                "time" => 45,
                "ingredients" => "Молоко (теплое) - 125 мл, Вода (теплая) - 125 мл, Яйцо - 1 шт., Масло растительное - 2 ст. ложки, Мука - 400 г, Дрожжи сухие - 7 г (1 маленький пакетик), Сахар - 2 ч. ложки, Соль - 1 ч. ложка, Сыр моцарелла (твёрдый) - 200 г, Сыр адыгейский - 250 г, Яйца - 4-5 шт., Масло сливочное - 100 г",
                "likes" => 24,
                "kitchen_id" => 3,
            ],
        ];

        DB::table('recipes')->insert($recipes);
    }
}
